Revit 2024 API
DisplayingOptionsDialogEventArgs Methods
The DisplayingOptionsDialogEventArgs type exposes the following members.
Methods
Name | Description
AddTab
Add tab to option dialog with tab name and handler information.
Cancel
 When the event is cancellable, may call the Cancel() method to cancel it.
 (Inherited from RevitAPIPreEventArgs.)
Dispose |  (Inherited from RevitAPIEventArgs.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsCancelled
 Indicates whether the event is being cancelled.
 (Inherited from RevitAPIEventArgs.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
DisplayingOptionsDialogEventArgs Class
Autodesk.Revit.UI.Events Namespace